java-web.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-06-26 Wed 01:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java Web</title>
<meta name="generator" content="Org mode">
<meta name="author" content="yaowuer">
<link rel='stylesheet' href='/asset/common.css' />



</head>
<body>
<div id="content">
<header>
<h1 class="title">Java Web</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e53d24">1. 预习</a></li>
<li><a href="#org83ac7a2">2. CS vs BS</a></li>
<li><a href="#orgb2fb4ce">3. Servlet</a></li>
<li><a href="#orgc3a3651">4. JSP</a></li>
<li><a href="#orgbc0997c">5. Cookie/Session</a></li>
<li><a href="#orgaaca2c6">6. El 表达式</a></li>
<li><a href="#orgd4ecb8d">7. JSTL 标签</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org9e53d24" class="outline-2">
<h2 id="org9e53d24"><span class="section-number-2">1</span> 预习</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>下载 Tomcat 服务器，完成安装</li>
<li>了解 Tomcat 的目录结构，并学会基本配置</li>
<li>将 Tomcat 配置到 eclipse/idea 中</li>
<li>了解 Servlet/jsp 的基本概念</li>
</ul>
</div>
</section>

<section id="outline-container-org83ac7a2" class="outline-2">
<h2 id="org83ac7a2"><span class="section-number-2">2</span> CS vs BS</h2>
<div class="outline-text-2" id="text-2">
<p>
Client-Server，客户端-服务端:
</p>
<ul class="org-ul">
<li>需要安装独立的应用程序</li>
<li>开发语言丰富多彩，比如 WinForm/WPF/QT/JavaFx
<ul class="org-ul">
<li>优点，灵活、强大、可定制性强</li>
<li>缺点，对于开发者来说，开发起来麻烦，开发需要掌握的基本知识太多。对于用户来说，必须要下载并安装单独的应用</li>
</ul></li>
<li>需要网络进行交互 (tcp/ip协议，socket 编程)</li>
</ul>

<p>
Browser-Server，浏览器-服务器:
</p>
<ul class="org-ul">
<li>借助浏览器进行更多底层任务的执行</li>
<li>为了渲染页面，推出了一套规则，叫 html</li>
<li>后来 html 虽然能渲染数据，但不够好看，所以就诞生了 css</li>
<li>后来虽然有了 css 的加持，页面好看了，但是页面不会动，也让人觉得不够爽</li>
<li>所以，就产生了 JavaScript，官方的称呼为 ECMAScript，简称 ES</li>
</ul>

<p>
Web 的时代就这样来临了。
</p>

<p>
大前端统一江湖的梦想就诞生了。
</p>
</div>
</section>
<section id="outline-container-orgb2fb4ce" class="outline-2">
<h2 id="orgb2fb4ce"><span class="section-number-2">3</span> Servlet</h2>
</section>
<section id="outline-container-orgc3a3651" class="outline-2">
<h2 id="orgc3a3651"><span class="section-number-2">4</span> JSP</h2>
</section>
<section id="outline-container-orgbc0997c" class="outline-2">
<h2 id="orgbc0997c"><span class="section-number-2">5</span> Cookie/Session</h2>
</section>
<section id="outline-container-orgaaca2c6" class="outline-2">
<h2 id="orgaaca2c6"><span class="section-number-2">6</span> El 表达式</h2>
</section>
<section id="outline-container-orgd4ecb8d" class="outline-2">
<h2 id="orgd4ecb8d"><span class="section-number-2">7</span> JSTL 标签</h2>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: yaowuer</p>
<p class="date">Created: 2019-06-26 Wed 01:59</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
